app/controllers/movies_controller.rb

   def index
    	@movies = Movie.order("#{sort_column} #{sort_direction}")
---
SELECT "movies".* FROM "movies" ORDER BY release_year desc

   def create
     @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "image", "rating", "release_year", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

   def update
     @movie = Movie.find params[:id]
     if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
UPDATE "movies" SET "image" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image", "https://images-na.ssl-images-amazon.com/images/M/MV5BODQwOTc5MDM2N15BMl5BanBnXkFtZTcwODQxNTEzNA@@._V1_UX182_CR0,0,182,268_AL_.jpg"], ["updated_at", 2016-10-26 06:46:49 UTC], ["id", 12]]